/*
 * SPDX-License-Identifier: (GPL-2.0-only OR BSD-2-Clause)
 * Copyright 2023 Hiroki Shirokura.
 * Copyright 2023 Kyoto University.
 */

#include <linux/if_ether.h>
#include <linux/in.h>
#include <linux/ip.h>
#include <linux/ipv6.h>
#include <linux/tcp.h>
#include <linux/udp.h>
#include <linux/bpf.h>
#include <linux/pkt_cls.h>
#include <bpf/bpf_helpers.h>
#include <bpf/bpf_endian.h>
#include "lib/lib.h"

#ifndef MAX_RULES
#define MAX_RULES 2
#endif
#ifndef RING_SIZE
#define RING_SIZE 7
#endif
#ifndef NAT_CACHE_MAX_RULES
#define NAT_CACHE_MAX_RULES 65535
#endif

struct {
  __uint(type, BPF_MAP_TYPE_LPM_TRIE);
  __uint(key_size, sizeof(struct trie4_key));
  __uint(value_size, sizeof(struct trie4_val));
  __uint(max_entries, 50);
  __uint(map_flags, BPF_F_NO_PREALLOC);
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, fib4) SEC(".maps");

struct {
  __uint(type, BPF_MAP_TYPE_LPM_TRIE);
  __uint(key_size, sizeof(struct trie6_key));
  __uint(value_size, sizeof(struct trie6_val));
  __uint(max_entries, 50);
  __uint(map_flags, BPF_F_NO_PREALLOC);
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, fib6) SEC(".maps");

struct {
  __uint(type, BPF_MAP_TYPE_PERCPU_HASH);
  __uint(key_size, sizeof(struct overlay_fib4_key));
  __uint(value_size, sizeof(struct overlay_fib4_val));
  __uint(max_entries, 100);
  __uint(map_flags, BPF_F_NO_PREALLOC);
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, overlay_fib4) SEC(".maps");

struct {
  __uint(type, BPF_MAP_TYPE_PERCPU_ARRAY);
  __type(key, __u32);
  __type(value, struct flow_processor);
  __uint(max_entries, RING_SIZE * MAX_RULES);
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, lb_backend) SEC(".maps");

struct {
  __uint(type, BPF_MAP_TYPE_PERCPU_ARRAY);
  __type(key, __u32);
  __type(value, struct in6_addr);
  __uint(max_entries, 1);
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, encap_source) SEC(".maps");

struct {
  __uint(type, BPF_MAP_TYPE_HASH);
  __uint(max_entries, NAT_CACHE_MAX_RULES);
  __type(key, struct addr_port);
  __type(value, struct addr_port_stats);
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, nat_out) SEC(".maps");

struct {
  __uint(type, BPF_MAP_TYPE_HASH);
  __uint(max_entries, NAT_CACHE_MAX_RULES);
  __type(key, struct addr_port);
  __type(value, struct addr_port_stats);
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, nat_ret) SEC(".maps");

struct {
  __uint(type, BPF_MAP_TYPE_LRU_HASH);
  __uint(max_entries, 65535);
  __type(key, struct mf_redir_rate_stat_key);
  __type(value, struct mf_redir_rate_stat_val);
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, rate_stats) SEC(".maps");

struct {
  __uint(type, BPF_MAP_TYPE_PERF_EVENT_ARRAY);
  __uint(key_size, sizeof(__u32));   // TODO: nos sure it is needed or not
  __uint(value_size, sizeof(__u32)); // TODO: nos sure it is needed or not
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, events) SEC(".maps");

struct {
  __uint(type, BPF_MAP_TYPE_PERCPU_HASH);
  __uint(key_size, sizeof(struct neigh_key));
  __uint(value_size, sizeof(struct neigh_val));
  __uint(max_entries, 100);
  __uint(map_flags, BPF_F_NO_PREALLOC);
  __uint(pinning, LIBBPF_PIN_BY_NAME);
} GLUE(NAME, neigh) SEC(".maps");

// NOTE(slankdev); It's possible verifier will be failed when the semantic
// sorting is adopted. In this case, we sorted by size and its alignment
// perspective.
struct metadata {
  __u8 ether_dst[6];               // 6
  __u16 ether_type;                // 8
  __u16 l3_offset;                 // 10
  __u8 l3_proto;                   // 11
  __u8 nh_family;                  // 12
  __u32 l3_saddr;                  // 16
  __u32 l3_daddr;                  // 20
  __u16 l4_sport;                  // 22
  __u16 l4_dport;                  // 24
  __u16 l4_icmp_id;                // 26
  __u16 num_segs;                  // 28
  __u32 nh_addr4;                  // 32
  struct in6_addr outer_ip6_saddr; // 48
  struct in6_addr outer_ip6_daddr; // 64
  struct in6_addr nh_addr6;        // 72
};

static inline int
tx_packet_neigh(struct xdp_md *ctx, int line,
                struct metadata *md)
{
  debug_function_call(ctx, __func__, line);

  struct trie4_key key = {0};
  struct trie4_val *val = NULL;
  struct trie6_key t6_key = {0};
  struct trie6_val *t6_val = NULL;
  struct neigh_key nk = {0};
  struct neigh_val *nv = NULL;
  __u8 *mac = NULL;

  // L3 Lookup
  switch (md->nh_family) {
  case AF_INET:
    key.addr = md->nh_addr4;
    key.prefixlen = 32;
    val = bpf_map_lookup_elem(&GLUE(NAME, fib4), &key);
    if (!val) {
      return error_packet(ctx, __LINE__);
    }
    switch (val->action) {
    case TRIE4_VAL_ACTION_L3_XCONNECT:
      if (val->l3_xconn_nh_count > 1) {
        return error_packet(ctx, __LINE__);
      }
      nk.family = val->l3_xconn_nh[0].nh_family;
      nk.addr4 = val->l3_xconn_nh[0].nh_addr4;
      memcpy(&nk.addr6, &val->l3_xconn_nh[0].nh_addr6, 16);
